Autodesk.Revit.DB.Architecture.StairsType.MiddleSupportType
The type of middle supports used in the stair.
invalidElementId if the stairs type has no middle support.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: supportType is not a valid middle support type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The stairs type has no middle support so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.RightSideSupportType
The type of right support used in the stair.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: rightSideStringerTypeId is not a valid support type.
-or-
When setting this property: The specified rightSideStringerTypeId doesn't match the desired style of the right side support.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The right support style is none, so this related data cannot be set.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.LeftSideSupportType
The type of left support used in the stair.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: leftSideStringerTypeId is not a valid support type.
-or-
When setting this property: The specified leftSideStringerTypeId doesn't match the desired style of the left side support.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The left support style is none, so this related data cannot be set.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.LandingType
The type for all landings in the stair element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The specified landingTypeId is not a valid landing type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.RunType
The type for all runs in the stair element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The specified runTypeId is not a valid run type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013